package cn.ply.cloud.java.reflect;

/**
 * @Author ply
 * @Description
 * @Date created in 2022/3/26
 * @ModifiedBy
 */
public class BaseInfo {
    /**
     *  反射的作用
     *  反射就是把Java类中的各个成分映射成一个个的Java对象。即在运行状态中，对于任意一个类，都能够知道这个类的所以属性和方法；
     *  对于任意一个对象，都能调用它的任意一个方法和属性。这种动态获取信息及动态调用对象方法的功能叫Java的反射机制。
     *1. 反射机制的功能
     * 　　Java反射机制主要提供了以下功能：
     * 在运行时判断任意一个对象所属的类。
     * 在运行时构造任意一个类的对象。
     * 在运行时判断任意一个类所具有的成员变量和方法。
     * 在运行时调用任意一个对象的方法。
     * 生成动态代理。
     * 　　2. 实现反射机制的类
     *  　　Java中主要由以下的类来实现Java反射机制（这些类都位于java.lang.reflect包中）：
     * Class类：代表一个类。 Field类：代表类的成员变量（成员变量也称为类的属性）。
     * Method类：代表类的方法。
     * Constructor类：代表类的构造方法。
     * Array类：提供了动态创建数组，以及访问数组的元素的静态方法。
     *
     *  内部类
     *
     *  泛型
     *
     *
     */
}
